Revit 2026 API

# FabricRoundingManager Properties

---

The FabricRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicableReinforcementRoundingSource | Identifies the source of the rounding settings for this element. |
|  | ApplicableSegmentLengthRounding | The applicable rounding for fabric segments. |
|  | ApplicableSegmentLengthRoundingMethod | The applicable rounding method for fabric segments. |
|  | ApplicableTotalLengthRounding | The applicable rounding for Cut Overall Length and Cut Overall Width parameters. |
|  | ApplicableTotalLengthRoundingMethod | The applicable rounding method for Cut Overall Length and Cut Overall Width parameters. |
|  | Element | The owner of the reinforcement rounding overrides. (Inherited from ReinforcementRoundingManager) |
|  | IsActiveOnElement | Defines whether reinforcement rounding is activated for the particular element. (Inherited from ReinforcementRoundingManager) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ReinforcementRoundingManager) |
|  | SegmentLengthRounding | The rounding for fabric segments. |
|  | SegmentLengthRoundingMethod | Identifies the segment length rounding method |
|  | TotalLengthRounding | The rounding for Cut Overall Length and Cut Overall Width parameters. |
|  | TotalLengthRoundingMethod | Identifies the total length rounding method |

#### Reference

FabricRoundingManager Class

Autodesk.Revit.DB.Structure Namespace